CSCI 2021 Contact Log System
Commands:
  create <name>:            creates a new log with specified name
  log:                      shows the name of the active contacts log
  add <name> <phone> <zip>: adds a new contact
  lookup <name>:            searches for a phone number by contact name
  clear:                    resets current contacts log
  print:                    shows all contacts in active log
  write_text:               saves all contacts to text file
  read_text <file_name>:    loads contacts from text file
  write_bin:                saves all contacts to binary file
  read_bin <file_name>:     loads contacts from binary file
  exit:                     exits the program
contacts> create Work
contacts> add Louise 6126254002 55455
contacts> add Desmond 9163777000 95051
contacts> add Sun 8553719460 90210
contacts> add Jin 5413450354 97401
contacts> add Hurley 6516358273 55113
contacts> write_text
Contacts log successfully written to Work.txt
contacts> clear
contacts> print
Error: You must create or load a contacts log first
contacts> read_text Work.txt
Contacts log loaded from text file
contacts> log
Work
contacts> print
All contacts in Work:
Name: Hurley, Phone Number: 6516358273, Zip Code: 55113
Name: Sun, Phone Number: 8553719460, Zip Code: 90210
Name: Louise, Phone Number: 6126254002, Zip Code: 55455
Name: Jin, Phone Number: 5413450354, Zip Code: 97401
Name: Desmond, Phone Number: 9163777000, Zip Code: 95051
contacts> lookup Louise
Louise: 6126254002
contacts> lookup Locke
No phone number for 'Locke' found
contacts> lookup Rousseau
No phone number for 'Rousseau' found
contacts> lookup Hurley
Hurley: 6516358273
contacts> lookup Jin
Jin: 5413450354
contacts> lookup Desmond
Desmond: 9163777000
contacts> lookup Sun
Sun: 8553719460
contacts> lookup Sun
Sun: 8553719460
contacts> lookup Ben
No phone number for 'Ben' found
contacts> exit
